### 什么是DNS?
NDS(domain name system)域名系统。互联网上计算机通信靠唯一的IP.而计算机是无法识别域名的，或者或人去计IP也不太现实。
NDS是应用层的协议，在UDP协议之上。使用端口号53。是Internet网上作为域名和IP地址相互映射的一个分布式数据库。
### DNS功能
每个IP地址都可以有一个主机名，主机名由一个或多个字符串组成，字符串之间用小数点隔开。有了主机名，就不要死记硬背每台IP设备的IP地址，
只要记住相对直观有意义的主机名就行了。这就是DNS协议所要完成的功能。
### DNS解析过程
比如在浏览器中输入www  . qq  .com 域名：
![](images/domain.png)
1. 首先浏览器会调用本机的DNS客户端，发送请求，UDP协议。操作系统会首先检查本地的hosts文件是否有这个网络网址映射，如果有就调用这个IP映射，完成域名解析。
2. 如果hosts文件没有这个地址映射，这开始查找** 本地DNS解析器缓存 ** 是否有这个网址映射关系，如果有则直接返回，完成解析。
3. 如果本地hosts文件和本地DNS解析器缓存都没有相应的网址映射关系，则首先会找TCP/ip参数中设置的首选DNS服务器，在此我们叫它** 本地DNS服务器 **，
此服务器接收到到请求，如果要查询的域名，包含在** 本地配置区域资源 **，则返回解析结果给客户机（端），完成域名解析，此解析具有权威性。 
4. 如果要查询的域名，不由本地DNS服务器区域解析，但该服务器已缓存了此网址映射关系，则调用这个IP地址映射，完成域名解析，此解析不具有权威性。
5. 如果本地DNS服务器本地区域文件与缓存解析都失效，则根据本地DNS服务器的设置（是否设置转发器）进行查询，如果未用转发模式，本地DNS就把请求发至13台根DNS，
根DNS服务器收到请求后会判断这个域名(.com)是谁来授权管理，并会返回一个负责该顶级域名服务器的一个IP。本地DNS服务器收到IP信息后，
将会联系负责.com域的这台服务器。这台负责.com域的服务器收到请求后，如果自己无法解析，它就会找一个管理.com域的下一级DNS服务器地址(http://qq.com)
给本地DNS服务器。当本地DNS服务器收到这个地址后，就会找http://qq.com域服务器，重复上面的动作，进行查询，直至找到www  . qq  .com主机。
6. 如果用的是转发模式，此DNS服务器就会把请求转发至上一级DNS服务器，由上一级服务器进行解析，上一级服务器如果不能解析，或找根DNS或把转请求转至上上级，
以此循环。不管是本地DNS服务器用是是转发，还是根提示，最后都是把结果返回给本地DNS服务器，由此DNS服务器再返回给客户机。
**  从客户端到本地DNS服务器是属于递归查询，而DNS服务器之间就是的交互查询就是迭代查询。 **
### 简单抽象
假设运行在用户主机上的某些应用程序（如Webl浏览器或者邮件阅读器）需要将主机名转换为IP地址。这些应用程序将调用DNS的客户机端，并指明需要被转换的主机名。
（在很多基于UNIX的机器上，应用程序为了执行这种转换需要调用函数gethostbyname（））。用户主机的DNS客户端接收到后，向网络中发送一个DNS查询报文。
所有DNS请求和回答报文使用的UDP数据报经过端口53发送（至于为什么使用UDP，请参看为什么域名根服务器只能有13台呢？ - 郭无心的回答）
经过若干ms到若干s的延时后，用户主机上的DNS客户端接收到一个提供所希望映射的DNS回答报文。这个查询结果则被传递到调用DNS的应用程序。因此，
从用户主机上调用应用程序的角度看，** DNS是一个提供简单、直接的转换服务的黑盒子。**但事实上，实现这个服务的黑盒子非常复杂，
它由分布于全球的大量DNS服务器以及定义了DNS服务器与查询主机通信方式的应用层协议组成。
